In [75]:
import pandas as pd
import numpy as np

In [90]:
df=pd.read_csv("titanic.csv")

In [77]:
dF

NameError: name 'dF' is not defined

In [78]:
df

    Cabin            Ticket number  Survived
0     NaN         A/5 21171      5         0
1     C85          PC 17599      3         1
2     NaN  STON/O2. 3101282      6         1
3    C123            113803      3         1
4     NaN            373450      A         0
..    ...               ...    ...       ...
886   NaN            211536      3         0
887   B42            112053      3         1
888   NaN        W./C. 6607      1         0
889  C148            111369      2         1
890   NaN            370376      3         0

[891 rows x 4 columns]

    Cabin            Ticket number
0     NaN         A/5 21171      5
1     C85          PC 17599      3
2     NaN  STON/O2. 3101282      6
3    C123            113803      3
4     NaN            373450      A
..    ...               ...    ...
886   NaN            211536      3
887   B42            112053      3
888   NaN        W./C. 6607      1
889  C148            111369      2
890   NaN            370376      3

[891 rows x 3 columns]

In [91]:
#extract numerical part
df['number_numerical']=pd.to_numeric(df["number"],errors='coerce',downcast='integer')

In [92]:
#extract categorical part
df['number_categorical']=np.where(df['number_numerical'].isnull(),df['number'],np.nan)

In [93]:
df.head()

,Cabin,Ticket,number,Survived,number_numerical,number_categorical
0,NaN,A/5 21171,5,0,5.0,NaN
1,C85,PC 17599,3,1,3.0,NaN
2,NaN,STON/O2. 3101282,6,1,6.0,NaN
3,C123,113803,3,1,3.0,NaN
4,NaN,373450,A,0,NaN,A

In [94]:
df["Cabin_Class"] = df["Cabin"].str.findall(r"[A-Za-z]").str.join("")
df["Cabin_Class"] = df["Cabin_Class"].replace("", "NaN")

In [97]:
df["Cabin_Number"] = df["Cabin"].str.findall(r"\d+").str.join("")
df["Cabin_Number"] = df["Cabin_Number"].replace("", "NaN")

In [98]:
df

,Cabin,Ticket,number,Survived,number_numerical,number_categorical,Cabin_Class,Cabin_Number
0,NaN,A/5 21171,5,0,5.0,NaN,NaN,NaN
1,C85,PC 17599,3,1,3.0,NaN,C,85
2,NaN,STON/O2. 3101282,6,1,6.0,NaN,NaN,NaN
3,C123,113803,3,1,3.0,NaN,C,123
4,NaN,373450,A,0,NaN,A,NaN,NaN
...,...,...,...,...,...,...,...,...
886,NaN,211536,3,0,3.0,NaN,NaN,NaN
887,B42,112053,3,1,3.0,NaN,B,42
888,NaN,W./C. 6607,1,0,1.0,NaN,NaN,NaN
889,C148,111369,2,1,2.0,NaN,C,148
890,NaN,370376,3,0,3.0,NaN,NaN,NaN

In [87]:
df.isnull().sum()

Cabin                 687
Ticket                  0
number                  0
Survived                0
number_numerical      139
number_categorical    752
Cabin_Class           687
Cabin_Number          687
dtype: int64

In [100]:
#EXTRACT THE LAST BIT OF TICKET AS A NUMBER
df['ticket_num']=df['Ticket'].apply(lambda s:s.split()[-1])
df['ticket_num']=pd.to_numeric(df['ticket_num'],errors='coerce',downcast='integer')

#extract first part of the ticket as category
df['ticket_cat']=df['Ticket'].apply(lambda s:s.split()[0])
df['ticket_cat']=np.where(df['ticket_cat'].str.isdigit(),np.nan,df['ticket_cat'])

In [101]:
df

,Cabin,Ticket,number,Survived,number_numerical,number_categorical,Cabin_Class,Cabin_Number,ticket_num,ticket_cat
0,NaN,A/5 21171,5,0,5.0,NaN,NaN,NaN,21171.0,A/5
1,C85,PC 17599,3,1,3.0,NaN,C,85,17599.0,PC
2,NaN,STON/O2. 3101282,6,1,6.0,NaN,NaN,NaN,3101282.0,STON/O2.
3,C123,113803,3,1,3.0,NaN,C,123,113803.0,NaN
4,NaN,373450,A,0,NaN,A,NaN,NaN,373450.0,NaN
...,...,...,...,...,...,...,...,...,...,...
886,NaN,211536,3,0,3.0,NaN,NaN,NaN,211536.0,NaN
887,B42,112053,3,1,3.0,NaN,B,42,112053.0,NaN
888,NaN,W./C. 6607,1,0,1.0,NaN,NaN,NaN,6607.0,W./C.
889,C148,111369,2,1,2.0,NaN,C,148,111369.0,NaN
890,NaN,370376,3,0,3.0,NaN,NaN,NaN,370376.0,NaN